#+BEGIN_SRC http :result output
POST http://127.0.0.1:8088/controlplane/onboard-master
User-Agent: ob-http
Content-Type: application/json

{
  "host": "localhost",
  "label": "armour::master-one",
  "credentials": "no-creds"
}
#+END_SRC


#+BEGIN_SRC http :result output
POST http://127.0.0.1:8088/controlplane/onboard-service
User-Agent: ob-http
Content-Type: application/json

{
  "label": "armour::service-1",
  "master": "armour::master-one"
}
#+END_SRC


#+BEGIN_SRC http :result output
POST http://127.0.0.1:8088/controlplane/update-policy
User-Agent: ob-http
Content-Type: application/json

{
   "service": "armour-service-1",
   "policy": "{\"externals\":{\"sockets\":{},\"timeout\":{\"secs\":3,\"nanos\":0}},\"code\":{},\"headers\":{},\"policies\":{}}"
}
#+END_SRC

#+RESULTS:
: HTTP/1.1 500 Internal Server Error
: content-length: 56
: content-type: text/plain; charset=utf-8
: date: Wed, 15 Jan 2020 10:07:06 GMT
: 
: App data is not configured, to configure use App::data()



